
N10=int(input("N10="))
p=int(input("p="))
k=1
Np=0
while N10!=0:
    Np=Np+(N10%p)*k
    k=k*10
    N10=N10//p
print(f"N{p} = {Np} " )
Все необходимые классные работы:
__________________________________________

1) Программы на пайтоне/BasaData.py - база данных в пайтоне с выбором запроса.
2) Программы на пайтоне/systemOfNumbers.py - 3 программы связанные с системами счисления: Перевод в десятичную, из десятичной и таблица перевода.
3) Программы на пайтоне/Морза.py - Перевод в азбуку морза.
4) Office program/ВСЕ по Экселю.xlsx - Все работы по экселю.
5) Grafics/Tree1,
   Grafics/Tree2,
   Grafics/Tree3,
   Grafics/Tree4,
   Grafics/Tree5 - домашнее задание по библиотеке с черепахой в пайтоне.
6) Grafics/Paporatnic.py - лист папоратника на библиотеке с черепахой.
7) Grafics/EGE.py - Задание ЕГЭ выполненное библиотекой с черепахой в пайтоне.
8) CodeHeminga.ipynb - Код Хемминга в Google Colab.
9) https://openprocessing.org/user/342850/?view=sketches&o=2 - ссылка на опенпроцессинг.
10) Программы на пайтоне/Python_CPlusPlus.py - Все знания на Python.
